; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_8 ?v2 ?v1)
             (pred_12 ?v13 ?v3)
             (pred_6 ?v2 ?v3)
             (pred_1 ?v5 ?v2 )
	     (pred_10 ?v2)
             (pred_2 ?v7)
             (pred_7 ?v13)
             (pred_4 ?v3)
             (pred_9 ?v2)
             (pred_3 ?v13)
             (pred_5 ?v2)
             (pred_11 ))



(:action op_1
:parameters (?v8 ?v4 ?v9 ?v10)
:precondition (and (pred_2 ?v8) (pred_2 ?v4) (pred_7 ?v9) (pred_4 ?v10)
          (pred_8 ?v8 ?v4) (pred_12 ?v9 ?v10)
                   (pred_6 ?v4 ?v10) (pred_10 ?v8) 
                   (pred_9 ?v4) (pred_3 ?v9))
:effect (and  (pred_5 ?v4) (not (pred_9 ?v4))))


(:action op_4
:parameters (?v8 ?v6)
:precondition (and (pred_2 ?v8) (pred_2 ?v6)
               (pred_10 ?v8) (pred_8 ?v8 ?v6) (pred_5 ?v6))
:effect (and (pred_10 ?v6) (not (pred_10 ?v8))))

(:action op_2
:parameters (?v8 ?v9)
:precondition (and (pred_2 ?v8) (pred_7 ?v9) 
                  (pred_10 ?v8) (pred_1 ?v9 ?v8) (pred_11 ))
:effect (and (pred_3 ?v9)
   (not (pred_1 ?v9 ?v8)) (not (pred_11 ))))


(:action op_5
:parameters (?v8 ?v11 ?v12)
:precondition (and (pred_2 ?v8) (pred_7 ?v11) (pred_7 ?v12)
                  (pred_10 ?v8) (pred_3 ?v12) (pred_1 ?v11 ?v8))
:effect (and (pred_3 ?v11) (pred_1 ?v12 ?v8)
        (not (pred_3 ?v12)) (not (pred_1 ?v11 ?v8))))

(:action op_3
:parameters (?v8 ?v9)
:precondition (and (pred_2 ?v8) (pred_7 ?v9) 
                  (pred_10 ?v8) (pred_3 ?v9))
:effect (and (pred_11 ) (pred_1 ?v9 ?v8) (not (pred_3 ?v9)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_16 obj_04 obj_14 obj_08 obj_13 obj_19 obj_05 obj_10 obj_12 obj_21 obj_06 obj_11 obj_15 obj_20 obj_18 obj_01
    obj_07 obj_17 obj_03
    obj_02 obj_09 obj_22
    )

    (:init
       (pred_11)

       (pred_2 obj_16)
       (pred_2 obj_04)
       (pred_2 obj_14)
       (pred_2 obj_08)
       (pred_2 obj_13)
       (pred_2 obj_19)
       (pred_2 obj_05)
       (pred_2 obj_10)
       (pred_2 obj_12)
       (pred_2 obj_21)
       (pred_2 obj_06)
       (pred_2 obj_11)
       (pred_2 obj_15)
       (pred_2 obj_20)
       (pred_2 obj_18)
       (pred_2 obj_01)
       (pred_4 obj_07)
       (pred_4 obj_17)
       (pred_4 obj_03)
       (pred_7 obj_02)
       (pred_7 obj_09)
       (pred_7 obj_22)

       (pred_8 obj_16 obj_13)
       (pred_8 obj_16 obj_04)
       (pred_8 obj_04 obj_19)
       (pred_8 obj_04 obj_14)
       (pred_8 obj_04 obj_16)
       (pred_8 obj_14 obj_05)
       (pred_8 obj_14 obj_08)
       (pred_8 obj_14 obj_04)
       (pred_8 obj_08 obj_10)
       (pred_8 obj_08 obj_14)
       (pred_8 obj_13 obj_12)
       (pred_8 obj_13 obj_19)
       (pred_8 obj_13 obj_16)
       (pred_8 obj_19 obj_21)
       (pred_8 obj_19 obj_05)
       (pred_8 obj_19 obj_04)
       (pred_8 obj_19 obj_13)
       (pred_8 obj_05 obj_06)
       (pred_8 obj_05 obj_10)
       (pred_8 obj_05 obj_14)
       (pred_8 obj_05 obj_19)
       (pred_8 obj_10 obj_11)
       (pred_8 obj_10 obj_08)
       (pred_8 obj_10 obj_05)
       (pred_8 obj_12 obj_15)
       (pred_8 obj_12 obj_21)
       (pred_8 obj_12 obj_13)
       (pred_8 obj_21 obj_20)
       (pred_8 obj_21 obj_06)
       (pred_8 obj_21 obj_19)
       (pred_8 obj_21 obj_12)
       (pred_8 obj_06 obj_18)
       (pred_8 obj_06 obj_11)
       (pred_8 obj_06 obj_05)
       (pred_8 obj_06 obj_21)
       (pred_8 obj_11 obj_01)
       (pred_8 obj_11 obj_10)
       (pred_8 obj_11 obj_06)
       (pred_8 obj_15 obj_20)
       (pred_8 obj_15 obj_12)
       (pred_8 obj_20 obj_18)
       (pred_8 obj_20 obj_21)
       (pred_8 obj_20 obj_15)
       (pred_8 obj_18 obj_01)
       (pred_8 obj_18 obj_06)
       (pred_8 obj_18 obj_20)
       (pred_8 obj_01 obj_11)
       (pred_8 obj_01 obj_18)
       (pred_9 obj_15)
       (pred_9 obj_04)
       (pred_9 obj_01)
       (pred_6  obj_15 obj_07)
       (pred_6  obj_04 obj_17)
       (pred_6  obj_01 obj_03)
       (pred_5 obj_16)
       (pred_5 obj_14)
       (pred_5 obj_08)
       (pred_5 obj_13)
       (pred_5 obj_19)
       (pred_5 obj_05)
       (pred_5 obj_10)
       (pred_5 obj_12)
       (pred_5 obj_21)
       (pred_5 obj_06)
       (pred_5 obj_11)
       (pred_5 obj_20)
       (pred_5 obj_18)

       (pred_12  obj_02 obj_07)
       (pred_12  obj_09 obj_17)
       (pred_12  obj_22 obj_03)
       (pred_1 obj_02 obj_13)
       (pred_1 obj_09 obj_05)
       (pred_1 obj_22 obj_21)
       (pred_10 obj_20)
    )

    (:goal (and
       (pred_1 obj_09 obj_13)
    ))
(:constraints
  (always (not (pred_10 obj_19)))
)
)

; plan
1. (op_4 obj_20 obj_21)
   deleted: (pred_10 obj_20)
   added: (pred_10 obj_21)
   goals met: 0 of 1
2. (op_4 obj_21 obj_06)
   deleted: (pred_10 obj_21)
   added: (pred_10 obj_06)
   goals met: 0 of 1
3. (op_4 obj_06 obj_05)
   deleted: (pred_10 obj_06)
   added: (pred_10 obj_05)
   goals met: 0 of 1
4. (op_2 obj_05 obj_09)
   deleted: (pred_1 obj_09 obj_05) (pred_11)
   added: (pred_3 obj_09)
   goals met: 0 of 1
5. (op_4 obj_05 obj_06)
   deleted: (pred_10 obj_05)
   added: (pred_10 obj_06)
   goals met: 0 of 1
6. (op_4 obj_06 obj_21)
   deleted: (pred_10 obj_06)
   added: (pred_10 obj_21)
   goals met: 0 of 1
7. (op_4 obj_21 obj_12)
   deleted: (pred_10 obj_21)
   added: (pred_10 obj_12)
   goals met: 0 of 1
8. (op_4 obj_12 obj_13)
   deleted: (pred_10 obj_12)
   added: (pred_10 obj_13)
   goals met: 0 of 1
9. (op_5 obj_13 obj_02 obj_09)
   deleted: (pred_3 obj_09) (pred_1 obj_02 obj_13)
   added: (pred_3 obj_02) (pred_1 obj_09 obj_13)
   goals met: 1 of 1
